Revit 2027 API
ViewOrientation3D.ForwardDirection Property
 The forward direction vector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ForwardDirection { get; }
Public ReadOnly Property ForwardDirection As XYZ
	Get
public:
property XYZ^ ForwardDirection {
	XYZ^ get ();
}
member ForwardDirection : XYZ with get
Property Value
XYZ
See Also
Reference
ViewOrientation3D Class
Autodesk.Revit.DB Namespace